# GetAnalyticalNodeData Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalyticalNodeData..::..GetAnalyticalNodeData Method
AnalyticalNodeData Class See Also
---
Returns AnalyticalNodeData associated with this element, if it exists.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static AnalyticalNodeData GetAnalyticalNodeData(
	Element element
)
```

Visual Basic
---
```text
Public Shared Function GetAnalyticalNodeData ( _
	element As Element _
) As AnalyticalNodeData
```

Visual C++
---
```text
public:
static AnalyticalNodeData^ GetAnalyticalNodeData(
	Element^ element
)
```

# ### Parameters
element
    Type: Autodesk.Revit.DB..::..Element The element from which we try to obtain AnalyticalNodeData.
# Remarks
If the input element doesn't have AnalyticalNodeData than it retuns nullNothingnullptra null reference (Nothing in Visual Basic). The input element should be a ReferencePoint.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
AnalyticalNodeData Class
Autodesk.Revit.DB.Structure Namespace